// підключення головних файлів
#include "stdafx.h"
#include <iostream>
#include <conio.h>
#include <math.h>
// оголошуєм матем сталу
#define M_PI       3.14159265358979323846

using namespace std;

int _tmain(int argc, _TCHAR* argv[])
{
	// встанолюєм параметри локалізації
	setlocale(LC_ALL, "RU");
	// форматний вивід даних з плаваючою крапкою
	//cout.setf(ios::fixed);
	//cout.precision(5);
	// описуємо змінну для запам'ятовування вибору з меню
	short int k;
	// видаємо меню на екран і чекаємо вибору від користувача
	cout << "Введите номер функции:\n";
	cout << "1 - Довжини сторiн b i c та кут A\n";
	cout << "2 - Довжина стророни c та кути A i B\n";
	cout << "3 - Кути трикутника\n";
	cin >> k;
	// починаємо аналізувати вибір користувача
	switch (k)
	{
	//якщо вибраний перший пункт меню
	case 1:
		// описуємо змінні
		long double b, c, A, B, C, t;
		// вводимо початкові дані
		cout << "\nВведите кути В та C (в градусах °): ";
		cin >> B >> C;
		// переведення в радіани
		B = M_PI * B / 180;
		C = M_PI * C / 180;
		// рахуюмо кут А
		A = M_PI - (B + C);
		// рахуюмо сторони  b / c
		t = sin(B + C);
		b = A * (sin(B) / t);
		c = A * (sin(C) / t);
		// переведення в градуси
		A = (A * 180) / M_PI;
		// виводимо результати та виходимо із оператора switch
		cout << "\nКут А\nA = " << A << "°\n";
		cout << "\nСторони b та c\nb = " << b << "\nc = " << c << endl;
		break;
	//якщо вибраний другий пункт меню
	case 2:		
		// описуємо змінні2
		long double a2, b2, c2, A2, B2, C2;
		// вводимо початкові дані
		cout << "\nВведите кут C°: ";
		cin >> C2;
		cout << "та сторони а та b: ";
		cin >> a2 >> b2;
		// переведення в радіани
		C2 = M_PI * C2 / 180;
		// рахуюмо сторону с
		c2 = sqrt(a2 * a2 + b2 * b2 - 2 * a2 * b2 * cos(C2));
		// рахуюмо кути А та В
		A2 = asin((a2 / c2) * sin(C2));
		B2 = asin((b2 / c2) * sin(C2));	
		// переведення в градуси
		A2 = (A2 * 180) / M_PI;	
		B2 = (B2 * 180) / M_PI;	
		// виводимо результати та виходимо із оператора switch
		cout << "\nКути А та В\nA = " << A2 << "°\nB = " << B2 << "°\n";
		cout << "\nСторонa c\nc = " << c2 << endl;
		break;

	case 3:		
		// описуємо змінні3
		long double a3, b3, c3, A3, B3, C3;
		// вводимо початкові дані
		cout << "\nВведите cторони (a, b, c): ";
		cin >> a3 >> b3 >> c3;
		if ((a3+b3>c3)||(a3+c3>b3)||(b3+c3>a3))
		{
		// рахуюмо кути А / В / C
 		A3 = acos((pow(b3, 2) + pow(c3, 2) - pow(a3 ,2)) / (2 * b3 * c3));
 		B3 = acos((pow(a3, 2) + pow(c3, 2) - pow(b3 ,2)) / (2 * a3 * c3));
 		C3 = acos((pow(b3, 2) + pow(a3, 2) - pow(c3 ,2)) / (2 * b3 * a3));
		// переводимо в градуси
		A3 = (A3 * 180) / M_PI;
		B3 = (B3 * 180) / M_PI;
		C3 = (C3 * 180) / M_PI;
		// виводимо результати та виходимо із оператора switch
		cout << "\nКути \nA = " << A3 << "°\nB = " << B3 << "°\nC = " << C3 << "°\n";
		}else cout << "\a\a\a\n\t***Трикутник не iснує***\n\n";
		break;
	default:
        cout<<"\a\a\a\n\t***Выбран неприпустимий режим роботи программы***\n\n";		
		break;
	}
	// робим паузу для перегляду результату
	_getch();	
	return 0;
}