// підключення головних файлів
#include "stdafx.h"
#include <iostream>
#include <conio.h>
#include <math.h>
// оголошуєм матем сталу експоненту
#define M_E        2.71828182845904523536

using namespace std;

int _tmain(int argc, _TCHAR* argv[])
{
	// встанолюєм параметри локалізації
	setlocale(LC_ALL, "RU");
	// форматний вивід даних з плаваючою крапкою
	cout.setf(ios::fixed);
	cout.precision(5);
	// описуємо змінну для запам'ятовування вибору з меню
	short int k;
	// видаємо меню на екран і чекаємо вибору від користувача
	cout << "Введите номер функции:\n";
	cout << "1 - функция Z\n";
	cout << "2 - функция P\n";
	cin >> k;
	// починаємо аналізувати вибір користувача
	switch (k)
	{
	//якщо вибраний перший пункт меню
	case 1:
		// описуємо змінні
		double x, y, z, d, c, a;
		// вводимо початкові дані
		cout << "Введите три числа (a, c, d):";
		cin >> a >> c >> d;
		// рахуюмо ф-ї / x / y / z /
		x = pow(1.5, cos(2 * c)) + log(2 * (sin(d) - 3));
		y = (cos(x) * cos(x) + sin(x * x * x)) / (pow(M_E, 2 * x) + x * x);
		z = pow((46 * cos(x + y)) / (23 * log(a)), 1 / 5);
		// виводимо результат та виходимо із оператора switch
		cout << "значение ф-и Z\t" << z << endl;
		break;
	//якщо вибраний другий пункт меню
	case 2:		
		// описуємо змінні
		double p, s, q, l, m;
		// вводимо початкові дані
		cout << "Введите два числа (l, m):";
		cin >> l >> m;
		// рахуюмо ф-ю s
		if ((l + m) < -2)	s = 0.5 * l;
		else				s = 0.5 * m;
		// рахуюмо ф-ю q
		if (s < 2)			q = 0.5 * s + 3;
		else if (s == 2)	q = s + 1;
		else				q = s * s - 3;
		// рахуюмо ф-ю p
		p = 3 - 1.5 * s + 4 * q;
		// виводимо результат та виходимо із оператора switch
		cout << "значение ф-и P\t" << p << endl;
		break;
	//якщо вибраний неприпустимий пункт меню
	default:
        cout<<"Выбран неприпустимий режим роботи программы\n\n";		
		break;
	}
	// робим паузу для перегляду результату
	_getch();	
	return 0;
}